-------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /DatasetConstruction/pcn02.log
  log type:  text
 opened on:   2 Jun 2015, 11:44:35

. 
. * pcn02.do
. * calculates racial/ethnic counts & percentages for all census tracts 
. *   (1970,1980,1990,2000,2010: White, Black, Hispanic, Asian)
. 
. use "$data/mrg01.dta"

. d

Contains data from /Datasets/mrg01.dta
  obs:        74,002                          
 vars:           207                          2 Jun 2015 11:35
 size:    61,051,650                          
-------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------------------------------
trtid10         double  %10.0g                
trctpop7        double  %12.0g                (sum) trctpop7
trctpop8        double  %12.0g                (sum) trctpop8
shrwht7n        double  %12.0g                (sum) shrwht7n
shrblk7n        double  %8.0g                 (sum) shrblk7n
shrhsp7n        double  %8.0g                 (sum) shrhsp7n
shrwht8n        double  %8.0g                 (sum) shrwht8n
shrblk8n        double  %8.0g                 (sum) shrblk8n
shrnhw8n        double  %8.0g                 (sum) shrnhw8n
shrnhb8n        double  %8.0g                 (sum) shrnhb8n
tractid         double  %10.0g                
state           str2    %2s                   
county          str33   %33s                  
tract           str20   %20s                  
placefp10       long    %12.0g                
cbsa10          long    %12.0g                
metdiv10        long    %12.0g                
ccflag10        byte    %8.0g                 
pop70           float   %9.0g                 
white70         float   %9.0g                 
black70         float   %9.0g                 
asian70         float   %9.0g                 
haw70           float   %9.0g                 
india70         float   %9.0g                 
china70         float   %9.0g                 
filip70         float   %9.0g                 
japan70         float   %9.0g                 
korea70         float   %9.0g                 
hu70            float   %9.0g                 
vac70           float   %9.0g                 
ohu70           float   %9.0g                 
dmulti70        float   %9.0g                 
multi70         float   %9.0g                 
a18und70        float   %9.0g                 
a60up70         float   %9.0g                 
a75up70         float   %9.0g                 
agewht70        float   %9.0g                 
a15wht70        float   %9.0g                 
a60wht70        float   %9.0g                 
ageblk70        float   %9.0g                 
a15blk70        float   %9.0g                 
a60blk70        float   %9.0g                 
ag15up70        float   %9.0g                 
mar70           float   %9.0g                 
wds70           float   %9.0g                 
own70           float   %9.0g                 
rent70          float   %9.0g                 
pop80           float   %9.0g                 
nhwht80         float   %9.0g                 
nhblk80         float   %9.0g                 
ntv80           float   %9.0g                 
asian80         float   %9.0g                 
hisp80          float   %9.0g                 
haw80           float   %9.0g                 
india80         float   %9.0g                 
china80         float   %9.0g                 
filip80         float   %9.0g                 
japan80         float   %9.0g                 
korea80         float   %9.0g                 
viet80          float   %9.0g                 
mex80           float   %9.0g                 
pr80            float   %9.0g                 
cuban80         float   %9.0g                 
hu80            float   %9.0g                 
vac80           float   %9.0g                 
ohu80           float   %9.0g                 
a18und80        float   %9.0g                 
a60up80         float   %9.0g                 
a75up80         float   %9.0g                 
ag15up80        float   %9.0g                 
mar80           float   %9.0g                 
wds80           float   %9.0g                 
mhmval80        double  %10.0g                
mrent80         float   %9.0g                 
own80           float   %9.0g                 
rent80          float   %9.0g                 
pop90           float   %9.0g                 
nhwht90         float   %9.0g                 
nhblk90         float   %9.0g                 
ntv90           float   %9.0g                 
asian90         float   %9.0g                 
hisp90          float   %9.0g                 
haw90           float   %9.0g                 
india90         float   %9.0g                 
china90         float   %9.0g                 
filip90         float   %9.0g                 
japan90         float   %9.0g                 
korea90         float   %9.0g                 
viet90          float   %9.0g                 
mex90           float   %9.0g                 
pr90            float   %9.0g                 
cuban90         float   %9.0g                 
hu90            float   %9.0g                 
vac90           float   %9.0g                 
ohu90           float   %9.0g                 
a18und90        float   %9.0g                 
a60up90         float   %9.0g                 
a75up90         float   %9.0g                 
agewht90        float   %9.0g                 
a15wht90        float   %9.0g                 
a60wht90        float   %9.0g                 
ageblk90        float   %9.0g                 
a15blk90        float   %9.0g                 
a60blk90        float   %9.0g                 
agehsp90        float   %9.0g                 
a15hsp90        float   %9.0g                 
a60hsp90        float   %9.0g                 
agentv90        float   %9.0g                 
a15ntv90        float   %9.0g                 
a60ntv90        float   %9.0g                 
ageasn90        float   %9.0g                 
a15asn90        float   %9.0g                 
a60asn90        float   %9.0g                 
ag15up90        float   %9.0g                 
mar90           float   %9.0g                 
wds90           float   %9.0g                 
mhmval90        double  %10.0g                
mrent90         float   %9.0g                 
own90           float   %9.0g                 
rent90          float   %9.0g                 
pop00           float   %9.0g                 
nhwht00         float   %9.0g                 
nhblk00         float   %9.0g                 
ntv00           float   %9.0g                 
asian00         float   %9.0g                 
hisp00          float   %9.0g                 
haw00           float   %9.0g                 
india00         float   %9.0g                 
china00         float   %9.0g                 
filip00         float   %9.0g                 
japan00         float   %9.0g                 
korea00         float   %9.0g                 
viet00          float   %9.0g                 
mex00           float   %9.0g                 
pr00            float   %9.0g                 
cuban00         float   %9.0g                 
hu00            float   %9.0g                 
vac00           float   %9.0g                 
ohu00           float   %9.0g                 
a18und00        float   %9.0g                 
a60up00         float   %9.0g                 
a75up00         float   %9.0g                 
agewht00        float   %9.0g                 
a15wht00        float   %9.0g                 
a60wht00        float   %9.0g                 
ageblk00        float   %9.0g                 
a15blk00        float   %9.0g                 
a60blk00        float   %9.0g                 
agehsp00        float   %9.0g                 
a15hsp00        float   %9.0g                 
a60hsp00        float   %9.0g                 
agentv00        float   %9.0g                 
a15ntv00        float   %9.0g                 
a60ntv00        float   %9.0g                 
ageasn00        float   %9.0g                 
a15asn00        float   %9.0g                 
a60asn00        float   %9.0g                 
family00        float   %9.0g                 
fhh00           float   %9.0g                 
own00           float   %9.0g                 
rent00          float   %9.0g                 
pop10           long    %12.0g                
nhwht10         int     %8.0g                 
nhblk10         int     %8.0g                 
ntv10           int     %8.0g                 
asian10         int     %8.0g                 
hisp10          int     %8.0g                 
haw10           int     %8.0g                 
india10         int     %8.0g                 
china10         int     %8.0g                 
filip10         int     %8.0g                 
japan10         int     %8.0g                 
korea10         int     %8.0g                 
viet10          int     %8.0g                 
mex10           int     %8.0g                 
pr10            int     %8.0g                 
cuban10         int     %8.0g                 
family10        int     %8.0g                 
fhh10           int     %8.0g                 
hu10            int     %8.0g                 
vac10           int     %8.0g                 
ohu10           int     %8.0g                 
own10           int     %8.0g                 
rent10          int     %8.0g                 
a18und10        int     %8.0g                 
a60up10         int     %8.0g                 
a75up10         int     %8.0g                 
agewht10        int     %8.0g                 
a15wht10        int     %8.0g                 
a60wht10        int     %8.0g                 
ageblk10        int     %8.0g                 
a15blk10        int     %8.0g                 
a60blk10        int     %8.0g                 
agehsp10        int     %8.0g                 
a15hsp10        int     %8.0g                 
a60hsp10        int     %8.0g                 
ageasn10        int     %8.0g                 
a15asn10        int     %8.0g                 
a60asn10        int     %8.0g                 
agentv10        int     %8.0g                 
a15ntv10        int     %8.0g                 
a60ntv10        int     %8.0g                 
_merge1         byte    %23.0g     _merge     
_merge2         byte    %23.0g     _merge     
_merge3         byte    %23.0g     _merge     
_merge4         byte    %23.0g     _merge     
_merge5         byte    %23.0g     _merge     
-------------------------------------------------------------------------------------------------------------
Sorted by:  tractid

. sum

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     trtid10 |     72693    2.78e+10    1.58e+10   1.00e+09   5.60e+10
    trctpop7 |     72693    2035.908    2122.126          0   31931.04
    trctpop8 |     72693    2490.287    1943.994          0   26707.08
    shrwht7n |     72693    1768.178    1919.353          0   27387.63
    shrblk7n |     72693    240.0372    901.2286          0      17067
-------------+--------------------------------------------------------
    shrhsp7n |     72693    120.9453    406.9836          0      10623
    shrwht8n |     72693    2046.647    1759.418          0      18264
    shrblk8n |     72693    309.0196    874.2577          0      12638
    shrnhw8n |     72693    1941.914    1728.586          0      16479
    shrnhb8n |     72693     304.357    864.1483          0      12450
-------------+--------------------------------------------------------
     tractid |     74002    2.84e+10    1.65e+10   1.00e+09   7.22e+10
       state |         0
      county |         0
       tract |         0
   placefp10 |     72693    57514.99    32376.85        100      99999
-------------+--------------------------------------------------------
      cbsa10 |     72693    35752.45    21224.02      10020      99999
    metdiv10 |     72693    82132.39    30519.35      13644      99999
    ccflag10 |     72693    .3885794    .4874307          0          1
       pop70 |     52758    2810.176    2073.874          0   34515.09
     white70 |     52758    2435.278      1912.6          0   31623.68
-------------+--------------------------------------------------------
     black70 |     52758    332.2071    1046.379          0   15686.08
     asian70 |     52758    34.29554    180.2965          0   9272.823
       haw70 |     52758    1.837428     28.7341          0   2072.347
     india70 |     52758    6.707343    49.59227          0   9271.817
     china70 |     52758    7.878521    72.23809          0   5800.686
-------------+--------------------------------------------------------
     filip70 |     52758    6.045623    45.09832          0   2884.551
     japan70 |     52758    10.62976    85.03428          0   3628.181
     korea70 |     52758    1.196861    5.214495          0        284
        hu70 |     52759    928.9992    711.3996          0       8380
       vac70 |     52731    45.69686     70.7376          0   3344.266
-------------+--------------------------------------------------------
       ohu70 |     52731    883.7918     676.966          0       8191
    dmulti70 |     52731    929.4887    711.2674          0       8380
     multi70 |     52731     315.922    510.7893          0       8309
    a18und70 |     52758     958.145    763.1608          0   9779.937
     a60up70 |     52758     375.268    369.5617          0       4641
-------------+--------------------------------------------------------
     a75up70 |     52758    97.70918    108.7277          0   2021.414
    agewht70 |     52728     2436.66    1912.265          0   31623.68
    a15wht70 |     52728    716.8426    605.4019          0   7103.659
    a60wht70 |     52728    340.7156    354.2498          0   4627.917
    ageblk70 |     43370    403.8526    1141.516          0   15686.08
-------------+--------------------------------------------------------
    a15blk70 |     43370    150.6431    437.5841          0   8510.291
    a60blk70 |     43370    37.56551    124.8197          0   2461.863
    ag15up70 |     52758    2066.897    1551.703          0   33714.35
       mar70 |     52758     1258.87      916.82          0   9702.177
       wds70 |     52758    277.5966    287.1827          0   3307.014
-------------+--------------------------------------------------------
       own70 |     52731    530.3018     436.963          0       6227
      rent70 |     52731      353.49    460.5362          0       7584
       pop80 |     59187    3059.369    1791.164          0    26728.7
     nhwht80 |     59187    2379.733    1681.295          0      16428
     nhblk80 |     59187    374.1318    944.4271          0   12957.42
-------------+--------------------------------------------------------
       ntv80 |     59187    13.62003    62.94598          0   7270.588
     asian80 |     59187    57.06045    214.9019          0   8449.822
      hisp80 |     59187    224.5517      556.12          0   12262.96
       haw80 |     59187    2.736243    41.86139          0   3537.856
     india80 |     59187    5.771217    15.12017          0        580
-------------+--------------------------------------------------------
     china80 |     59187    13.31056     84.1892          0       6688
     filip80 |     59187     12.6705    68.06855          0   4366.257
     japan80 |     59187    11.50305    85.01027          0   5047.409
     korea80 |     59187    5.678832    18.98262          0    1058.43
      viet80 |     59187    4.188927    19.34445          0   1417.303
-------------+--------------------------------------------------------
       mex80 |     59187    131.1187    433.2657          0   11749.42
        pr80 |     59187    33.45248    176.8504          0       5607
     cuban80 |     59187    13.30297    135.6999          0   5103.754
        hu80 |     59187    1167.112    703.6455          0      10955
       vac80 |     59187    75.91361    96.67833          0   4719.925
-------------+--------------------------------------------------------
       ohu80 |     59187    1091.198    662.3258          0      10775
    a18und80 |     59187    812.6384    583.0331          0   6556.916
     a60up80 |     59187    446.7838    385.5386          0       8169
     a75up80 |     59187    123.8785    131.9883          0       2799
    ag15up80 |     57301    2352.075    1424.806          0      22883
-------------+--------------------------------------------------------
       mar80 |     57301    1315.219     828.697          0      12820
       wds80 |     57301    394.2322    300.6309          0       4625
    mhmval80 |     56006    57045.42    30589.01       5000     225000
     mrent80 |     54393    222.0795    83.24561    25.4255        525
       own80 |     57355    669.3494    469.4027          0   4957.873
-------------+--------------------------------------------------------
      rent80 |     57355    414.1509    450.2096          0       9557
       pop90 |     72693     3419.75    1625.195          0   35721.33
     nhwht90 |     72693    2586.936    1582.162          0   21560.72
     nhblk90 |     72693     401.559    853.6464          0      12121
       ntv90 |     72693    24.66178    148.4068          0   7168.041
-------------+--------------------------------------------------------
     asian90 |     72693    95.81474    269.0018          0       7899
      hisp90 |     72693    307.3556    701.4777          0   13873.31
       haw90 |     72693    2.900596    42.88341          0   3998.065
     india90 |     72693    11.21646    30.44271          0   1155.849
     china90 |     72693    22.63339    110.6619          0       7873
-------------+--------------------------------------------------------
     filip90 |     72693    19.32069    91.46803          0       4375
     japan90 |     72693    11.65753    76.12729          0   4086.424
     korea90 |     72693    10.98723    40.62062          0       2029
      viet90 |     72693    8.450993    39.76731          0       2396
       mex90 |     72693    185.5728    545.5423          0   13353.08
-------------+--------------------------------------------------------
        pr90 |     72693    37.49234    173.4458          0       5632
     cuban90 |     72693    14.35666    147.3254          0    7643.32
        hu90 |     72693    1406.778    688.7519          0   11898.13
       vac90 |     72693    141.9117    215.3685          0   10686.99
       ohu90 |     72693    1264.867    619.0159          0      10825
-------------+--------------------------------------------------------
    a18und90 |     72693    874.9651    491.0955          0   8238.904
     a60up90 |     72693    575.8056    383.1786          0   13318.51
     a75up90 |     72693    180.6927    153.8949          0   4487.099
    agewht90 |     72693    2745.868    1574.538          0   23140.84
    a15wht90 |     72693    586.2046    386.8531          0   5374.853
-------------+--------------------------------------------------------
    a60wht90 |     72693    509.8487    385.3862          0   13251.94
    ageblk90 |     72693    412.1344    868.8758          0      12401
    a15blk90 |     72693    117.7275    255.5029          0   3515.525
    a60blk90 |     72693    47.73428     127.293          0       2166
    agehsp90 |     72693    307.3556    701.4777          0   13873.31
-------------+--------------------------------------------------------
    a15hsp90 |     72693    95.88135    226.5798          0   4055.398
    a60hsp90 |     72693    23.58942    74.05431          0       2369
    agentv90 |     72693     26.9355    151.0964          0   7262.866
    a15ntv90 |     72693    8.599673    58.15498          0   3069.431
    a60ntv90 |     72693     2.28132    13.16919          0   619.4399
-------------+--------------------------------------------------------
    ageasn90 |     72693    100.0103    280.2333          0       7930
    a15asn90 |     72693    25.45196    71.36736          0   1698.012
    a60asn90 |     72693    9.257439    45.42663          0       1987
    ag15up90 |     72693    2682.812    1286.222          0   27979.03
       mar90 |     72693     1470.57    768.3074          0   11283.12
-------------+--------------------------------------------------------
       wds90 |     72693    490.3794    284.6945          0       5523
    mhmval90 |     72461    101489.3    79421.29          0     500001
     mrent90 |     72528    393.8795    185.3001          0       1001
       own90 |     72693    811.9723    467.5482          0   8180.068
      rent90 |     72693    452.8944     409.924          0       8653
-------------+--------------------------------------------------------
       pop00 |     72693    3871.376    1601.656          0   36205.77
     nhwht00 |     72693    2676.362    1618.367          0   20618.81
     nhblk00 |     72693     486.756    878.1573          0      14039
       ntv00 |     72693    43.37414    176.3538          0       8609
     asian00 |     72693     162.699    373.2532          0       9491
-------------+--------------------------------------------------------
      hisp00 |     72693    485.6839    910.5947          0      13391
       haw00 |     72693    1.934877    26.32966          0   2755.302
     india00 |     72693     26.1318    70.39388          0       3475
     china00 |     72693    39.61366    158.4612          0       9417
     filip00 |     72693    32.53154    127.2419          0       5346
-------------+--------------------------------------------------------
     japan00 |     72693    15.80526    83.12281          0       3265
     korea00 |     72693    16.89883    59.67602          0       3456
      viet00 |     72693     16.8343    74.92798          0       4217
       mex00 |     72693    283.9436    668.5517          0       9030
        pr00 |     72693    46.85703     164.478          0       4508
-------------+--------------------------------------------------------
     cuban00 |     72693    17.08122    154.3245          0   5671.652
        hu00 |     72693    1594.433    680.5791          0   12365.57
       vac00 |     72693    143.3977    220.6369          0   10600.73
       ohu00 |     72693    1451.035    616.0193          0      11168
    a18und00 |     72693    994.5086    508.9301          0   8466.573
-------------+--------------------------------------------------------
     a60up00 |     72693    630.0084    374.5174          0    7147.73
     a75up00 |     72693    228.3682    178.2346          0       4261
    agewht00 |     72693    2676.362    1618.367          0   20618.81
    a15wht00 |     72693    535.8067    393.8635          0   4078.914
    a60wht00 |     72693    518.9891    384.6214          0   6368.911
-------------+--------------------------------------------------------
    ageblk00 |     72693    467.0028    864.8627          0      13677
    a15blk00 |     72693    130.2586    252.6945          0       2750
    a60blk00 |     72693    52.76007    123.8328          0       2849
    agehsp00 |     72693    485.6839    910.5947          0      13391
    a15hsp00 |     72693    152.7227    296.1656          0       3534
-------------+--------------------------------------------------------
    a60hsp00 |     72693    34.17108    91.72247          0   2422.143
    agentv00 |     72693    28.46055    168.1008          0       8471
    a15ntv00 |     72693    8.349428    60.72522          0       3228
    a60ntv00 |     72693    2.548622    15.78024          0   737.0356
    ageasn00 |     72693    144.1222    340.0846          0       9403
-------------+--------------------------------------------------------
    a15asn00 |     72693     30.6973    73.60209          0       1596
    a60asn00 |     72693    16.02669    56.51411          0       2007
    family00 |     72693    987.5414     433.871          0       6440
       fhh00 |     72693    120.9874    95.47726          0       1347
       own00 |     72693    960.4192    513.6135          0   4910.761
-------------+--------------------------------------------------------
      rent00 |     72693     490.616    425.4311          0       8544
       pop10 |     74002    4222.471    1982.711          0      37452
     nhwht10 |     74002    2659.989      1826.1          0      28555
     nhblk10 |     74002    542.2663    884.3162          0      15910
       ntv10 |     74002    48.28533    185.9385          0       9120
-------------+--------------------------------------------------------
     asian10 |     74002    229.9072    480.5514          0      11234
      hisp10 |     74002    731.9539    1188.849          0      15420
       haw10 |     74002    2.111646    26.87508          0       2836
     india10 |     74002    43.08719    124.9195          0       5363
     china10 |     74002    54.42837    191.6898          0       8979
-------------+--------------------------------------------------------
     filip10 |     74002    46.17828    156.3588          0       7462
     japan10 |     74002    17.62924    85.79451          0       3186
     korea10 |     74002    23.06731    79.79189          0       3970
      viet10 |     74002    23.48132    96.79736          0       4946
       mex10 |     74002    429.8292    892.5489          0      14607
-------------+--------------------------------------------------------
        pr10 |     74002    110.5154    508.1748          0      12076
     cuban10 |     74002    24.36971    193.6023          0       7129
    family10 |     74002    1061.385    537.7597          0      11821
       fhh10 |     74002    136.4218    100.2427          0       1310
        hu10 |     74002    1801.866    837.2058          0      21535
-------------+--------------------------------------------------------
       vac10 |     74002      206.06    287.7421          0      11862
       ohu10 |     74002    1595.806    735.6354          0      16043
       own10 |     74002    1040.137    619.7805          0      15437
      rent10 |     74002    555.6685    448.7906          0       8281
    a18und10 |     74002    1014.632    618.6575          0      11845
-------------+--------------------------------------------------------
     a60up10 |     74002    781.6813    459.2385          0      24266
     a75up10 |     74002     253.843     189.681          0       3988
    agewht10 |     74002    2659.989      1826.1          0      28555
    a15wht10 |     74002    471.1345    418.1227          0       7734
    a60wht10 |     74002    608.5994    474.5247          0      23534
-------------+--------------------------------------------------------
    ageblk10 |     74002    509.3175    868.3352          0      15558
    a15blk10 |     74002    122.1255    220.7133          0       4000
    a60blk10 |     74002    67.96873    137.5366          0       4395
    agehsp10 |     74002    731.9539    1188.849          0      15420
    a15hsp10 |     74002    217.6741    354.8477          0       5910
-------------+--------------------------------------------------------
    a60hsp10 |     74002     66.3111    153.5036          0       2861
    ageasn10 |     74002    202.0176    440.4189          0      10462
    a15asn10 |     74002     39.7139    92.79053          0       2951
    a60asn10 |     74002    28.48923    77.97347          0       2044
    agentv10 |     74002    30.36981     174.313          0       8987
-------------+--------------------------------------------------------
    a15ntv10 |     74002    7.675941    53.40458          0       3211
    a60ntv10 |     74002    3.798843    21.24498          0        929
     _merge1 |     74002    2.982311    .1318183          2          3
     _merge2 |     74002    2.982311    .1318183          2          3
     _merge3 |     74002    2.799803    .4001506          2          3
-------------+--------------------------------------------------------
     _merge4 |     74002     2.71294    .4523928          2          3
     _merge5 |     74002    2.982311    .1318183          2          3

. keep trtid10 tractid state county tract placefp10 cbsa10 metdiv10 ccflag10 ///
>          shr* trctpop7 trctpop8 ///
>          pop70 white70 black70 asian70 ///
>          pop80 nhwht80 nhblk80 asian80 hisp80 ///
>          pop90 nhwht90 nhblk90 asian90 hisp90 ///
>          pop00 nhwht00 nhblk00 asian00 hisp00 ///
>          pop10 nhwht10 nhblk10 asian10 hisp10 

. 
. global yrs 70 80 90 00 10 

. 
. ************************
. * Generate percentages *
. ************************
. 
. * 1970 Estimates 
. gen nhw70a= round(white70*(shrnhw8n/shrwht8n))
(21863 missing values generated)

. replace nhw70a = white70 if nhw70a==. & shrwht8n==0
(619 real changes made)

. label var nhw70a "Number non-Latino white; 1970 (estimated)"

. gen nhb70a = round(black70*(shrnhb8n/shrblk8n))
(28315 missing values generated)

. replace nhb70a = black70 if nhb70a==. & shrblk8n==0
(7071 real changes made)

. label var nhb70a "Number non-Latino black; 1970 (estimated)"

. gen hisp70=shrhsp7n 
(1309 missing values generated)

. 
. * Rename 1970 vars to be consistent w/ 1980-2010
. ren nhw70a nhwht70

. ren nhb70a nhblk70

. 
. * Create total population for each tract=W+B+H+A
. foreach yr in $yrs {
  2.     egen wbha`yr' = rowtotal(nhwht`yr' nhblk`yr' hisp`yr' asian`yr')
  3.     label var wbha`yr' "Total residents that are white, black, Hispanic, Asian:`yr'"
  4.     }

. 
. * create dependent variables 1980-2010: percent white, black, hispanic, asian
. foreach yr in $yrs {
  2.         gen pw`yr'=nhwht`yr'/wbha`yr'
  3.         gen pb`yr'=nhblk`yr'/wbha`yr'
  4.         gen ph`yr'=hisp`yr'/wbha`yr'
  5.         gen pa`yr'=asian`yr'/wbha`yr'
  6.         label var pw`yr' "tract proportion nhw`yr'"
  7.         label var pb`yr' "tract proportion nhb`yr'"
  8.         label var ph`yr' "tract proportion hisp`yr'"
  9.         label var pa`yr' "tract proportion asian`yr'"   
 10. }
(21477 missing values generated)
(21477 missing values generated)
(21467 missing values generated)
(21477 missing values generated)
(15040 missing values generated)
(15040 missing values generated)
(15040 missing values generated)
(15040 missing values generated)
(1448 missing values generated)
(1448 missing values generated)
(1448 missing values generated)
(1448 missing values generated)
(1439 missing values generated)
(1439 missing values generated)
(1439 missing values generated)
(1439 missing values generated)
(578 missing values generated)
(578 missing values generated)
(578 missing values generated)
(578 missing values generated)

.         
. keep trtid10 tractid state county tract cbsa10 placefp10 metdiv10 ccflag10 ///
>         nhwht70 nhblk70 hisp70 asian70 trctpop7 pop70 wbha70 pw70 pb70 ph70 pa70 ///
>         nhwht80 nhblk80 hisp80 asian80 pop80 wbha80 pw80 pb80 ph80 pa80 ///
>         nhwht90 nhblk90 hisp90 asian90 pop90 wbha90 pw90 pb90 ph90 pa90 ///
>         nhwht00 nhblk00 hisp00 asian00 pop00 wbha00 pw00 pb00 ph00 pa00 ///
>         nhwht10 nhblk10 hisp10 asian10 pop10 wbha10 pw10 pb10 ph10 pa10

.         
. d

Contains data from /Datasets/mrg01.dta
  obs:        74,002                          
 vars:            60                          2 Jun 2015 11:35
 size:    21,016,568                          
-------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------------------------------
trtid10         double  %10.0g                
trctpop7        double  %12.0g                (sum) trctpop7
tractid         double  %10.0g                
state           str2    %2s                   
county          str33   %33s                  
tract           str20   %20s                  
placefp10       long    %12.0g                
cbsa10          long    %12.0g                
metdiv10        long    %12.0g                
ccflag10        byte    %8.0g                 
pop70           float   %9.0g                 
asian70         float   %9.0g                 
pop80           float   %9.0g                 
nhwht80         float   %9.0g                 
nhblk80         float   %9.0g                 
asian80         float   %9.0g                 
hisp80          float   %9.0g                 
pop90           float   %9.0g                 
nhwht90         float   %9.0g                 
nhblk90         float   %9.0g                 
asian90         float   %9.0g                 
hisp90          float   %9.0g                 
pop00           float   %9.0g                 
nhwht00         float   %9.0g                 
nhblk00         float   %9.0g                 
asian00         float   %9.0g                 
hisp00          float   %9.0g                 
pop10           long    %12.0g                
nhwht10         int     %8.0g                 
nhblk10         int     %8.0g                 
asian10         int     %8.0g                 
hisp10          int     %8.0g                 
nhwht70         float   %9.0g                 Number non-Latino white; 1970 (estimated)
nhblk70         float   %9.0g                 Number non-Latino black; 1970 (estimated)
hisp70          float   %9.0g                 
wbha70          float   %9.0g                 Total residents that are white, black, Hispanic, Asian:70
wbha80          float   %9.0g                 Total residents that are white, black, Hispanic, Asian:80
wbha90          float   %9.0g                 Total residents that are white, black, Hispanic, Asian:90
wbha00          float   %9.0g                 Total residents that are white, black, Hispanic, Asian:00
wbha10          float   %9.0g                 Total residents that are white, black, Hispanic, Asian:10
pw70            float   %9.0g                 tract proportion nhw70
pb70            float   %9.0g                 tract proportion nhb70
ph70            float   %9.0g                 tract proportion hisp70
pa70            float   %9.0g                 tract proportion asian70
pw80            float   %9.0g                 tract proportion nhw80
pb80            float   %9.0g                 tract proportion nhb80
ph80            float   %9.0g                 tract proportion hisp80
pa80            float   %9.0g                 tract proportion asian80
pw90            float   %9.0g                 tract proportion nhw90
pb90            float   %9.0g                 tract proportion nhb90
ph90            float   %9.0g                 tract proportion hisp90
pa90            float   %9.0g                 tract proportion asian90
pw00            float   %9.0g                 tract proportion nhw00
pb00            float   %9.0g                 tract proportion nhb00
ph00            float   %9.0g                 tract proportion hisp00
pa00            float   %9.0g                 tract proportion asian00
pw10            float   %9.0g                 tract proportion nhw10
pb10            float   %9.0g                 tract proportion nhb10
ph10            float   %9.0g                 tract proportion hisp10
pa10            float   %9.0g                 tract proportion asian10
-------------------------------------------------------------------------------------------------------------
Sorted by:  tractid
     Note:  dataset has changed since last saved

. sum

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     trtid10 |     72693    2.78e+10    1.58e+10   1.00e+09   5.60e+10
    trctpop7 |     72693    2035.908    2122.126          0   31931.04
     tractid |     74002    2.84e+10    1.65e+10   1.00e+09   7.22e+10
       state |         0
      county |         0
-------------+--------------------------------------------------------
       tract |         0
   placefp10 |     72693    57514.99    32376.85        100      99999
      cbsa10 |     72693    35752.45    21224.02      10020      99999
    metdiv10 |     72693    82132.39    30519.35      13644      99999
    ccflag10 |     72693    .3885794    .4874307          0          1
-------------+--------------------------------------------------------
       pop70 |     52758    2810.176    2073.874          0   34515.09
     asian70 |     52758    34.29554    180.2965          0   9272.823
       pop80 |     59187    3059.369    1791.164          0    26728.7
     nhwht80 |     59187    2379.733    1681.295          0      16428
     nhblk80 |     59187    374.1318    944.4271          0   12957.42
-------------+--------------------------------------------------------
     asian80 |     59187    57.06045    214.9019          0   8449.822
      hisp80 |     59187    224.5517      556.12          0   12262.96
       pop90 |     72693     3419.75    1625.195          0   35721.33
     nhwht90 |     72693    2586.936    1582.162          0   21560.72
     nhblk90 |     72693     401.559    853.6464          0      12121
-------------+--------------------------------------------------------
     asian90 |     72693    95.81474    269.0018          0       7899
      hisp90 |     72693    307.3556    701.4777          0   13873.31
       pop00 |     72693    3871.376    1601.656          0   36205.77
     nhwht00 |     72693    2676.362    1618.367          0   20618.81
     nhblk00 |     72693     486.756    878.1573          0      14039
-------------+--------------------------------------------------------
     asian00 |     72693     162.699    373.2532          0       9491
      hisp00 |     72693    485.6839    910.5947          0      13391
       pop10 |     74002    4222.471    1982.711          0      37452
     nhwht10 |     74002    2659.989      1826.1          0      28555
     nhblk10 |     74002    542.2663    884.3162          0      15910
-------------+--------------------------------------------------------
     asian10 |     74002    229.9072    480.5514          0      11234
      hisp10 |     74002    731.9539    1188.849          0      15420
     nhwht70 |     52758    2267.059    1856.341          0      30278
     nhblk70 |     52758    327.1433    1034.224          0      15469
      hisp70 |     72693    120.9453    406.9836          0      10623
-------------+--------------------------------------------------------
      wbha70 |     74002    1992.732    2149.167          0   34523.03
      wbha80 |     74002    2427.782    2002.503          0      26323
      wbha90 |     74002    3331.671    1668.488          0   35048.88
      wbha00 |     74002     3744.08    1655.473          0   35335.96
      wbha10 |     74002    4164.116    1972.114          0      36737
-------------+--------------------------------------------------------
        pw70 |     52525     .824938    .2563638          0          1
        pb70 |     52525    .0876231    .2048448          0          1
        ph70 |     52535    .0723019    .1499649          0          1
        pa70 |     52525    .0153137    .0716416          0          1
        pw80 |     58962    .7985385    .2672874          0          1
-------------+--------------------------------------------------------
        pb80 |     58962    .1077469    .2207925          0   .9970326
        ph80 |     58962    .0753938     .147946          0          1
        pa80 |     58962    .0183208     .056006          0          1
        pw90 |     72554    .7702724    .2766295          0          1
        pb90 |     72554     .115091    .2176014          0          1
-------------+--------------------------------------------------------
        ph90 |     72554    .0881883    .1664912          0          1
        pa90 |     72554    .0264483    .0637802          0   .9956522
        pw00 |     72563    .7055406    .2979578          0          1
        pb00 |     72563    .1334264    .2266343          0          1
        ph00 |     72563    .1206101    .1929363          0          1
-------------+--------------------------------------------------------
        pa00 |     72563    .0404229    .0820696          0        .95
        pw10 |     73424     .640911    .3103312          0          1
        pb10 |     73424    .1422925    .2239923          0          1
        ph10 |     73424    .1655559    .2285299          0          1
        pa10 |     73424    .0512406    .0937875          0          1

. 
. save "$data/pcn02", replace
(note: file /Datasets/pcn02.dta not found)
file /Datasets/pcn02.dta saved

. 
. log close
      name:  <unnamed>
       log:  /DatasetConstruction/pcn02.log
  log type:  text
 closed on:   2 Jun 2015, 11:44:37
-------------------------------------------------------------------------------------------------------------
